ConfigFiles/Enums/СостоянияЗадачПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СостоянияЗадачПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ЗапланированаОжидаетПредшествующие</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ВыполняетсяОжидаетДочерних</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполняется</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СтатусыЗадачПроцессов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СтатусыЗадачПроцессов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Запланирована</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятаКВыполнению</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Выполнена</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Отменена</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ConfigFiles/Enums/СостоянияЗадачПроцессов/Ext/ManagerModule.bsl
#Область ПрограммныйИнтерфейс

Функция СостоянияГотовоКВыполнениюВыполняется() Экспорт
	
	Состояния = Новый Массив;
	Состояния.Добавить(Перечисления.СостоянияЗадачПроцессов.Запланирована);
	Состояния.Добавить(Перечисления.СостоянияЗадачПроцессов.ВыполняетсяОжидаетДочерних);
	Состояния.Добавить(Перечисления.СостоянияЗадачПроцессов.Выполняется);
	
	Возврат Состояния;
	
КонецФункции

Функция СостояниеПоСтатусуИМаксимальноВозможномуСтатусу(Статус, МаксимальныйВозможныйСтатус) Экспорт
	
	НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.ПустаяСсылка();
	Если Статус = Перечисления.СтатусыЗадачПроцессов.Запланирована Тогда
		Если МаксимальныйВозможныйСтатус = Перечисления.СтатусыЗадачПроцессов.ПринятаКВыполнению 
			Или МаксимальныйВозможныйСтатус = Перечисления.СтатусыЗадачПроцессов.Выполнена Тогда
			НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.Запланирована;
		Иначе
			НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.ЗапланированаОжидаетПредшествующие
		КонецЕсли;
	ИначеЕсли Статус = Перечисления.СтатусыЗадачПроцессов.ПринятаКВыполнению Тогда
		Если МаксимальныйВозможныйСтатус = Перечисления.СтатусыЗадачПроцессов.Выполнена Тогда
			НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.Выполняется;
		Иначе 
			НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.ВыполняетсяОжидаетДочерних;
		КонецЕсли;
	ИначеЕсли Статус = Перечисления.СтатусыЗадачПроцессов.Выполнена Тогда
		НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.Выполнена;
	Иначе
		НовоеСостояние = Перечисления.СостоянияЗадачПроцессов.Отменена;
	КонецЕсли;
	
	Возврат НовоеСостояние;
	
КонецФункции
#КонецОбласти
